INSERT INTO genre (`title`)
VALUES ('Научная фантастика'),
       ('Ужасы'),
       ('Фэнтези'),
       ('Фантастика');

INSERT INTO author (`name`, `surname`)
VALUES ('Дин', 'Кунц'),
       ('Терри', 'Пратчетт'),
       ('Нил', 'Гейман'),
       ('Айзек', 'Азимов');

INSERT INTO book (`title`, `release_date`)
VALUES ('Прелюдия к Основанию', '1988-09-16'),
       ('Путь к Основанию', '1993-06-06'),
       ('Ангелы-хранители', '1987-04-21'),
       ('Благие знамения', '1990-05-01'),
       ('Цвет волшебства', '1983-03-08'),
       ('Звёздная пыль', '1999-01-02');

INSERT INTO book_genre (`book_id`, `genre_id`)
VALUES (1, 1),
       (2, 1),
       (3, 2),
       (4, 3),
       (5, 3),
       (6, 3),
       (6, 4);

INSERT INTO book_author (`book_id`, `author_id`)
VALUES (1, 4),
       (2, 4),
       (3, 1),
       (4, 2),
       (4, 3),
       (5, 2),
       (6, 3);
